Revit 2015 API
Units.GetDisplayUnitType Method
 Gets the display unit for the UT_Length unit type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015.  Use GetFormatOptions(UnitType.UT_Length).DisplayUnits instead.")]
public DisplayUnitType GetDisplayUnitType()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015.  Use GetFormatOptions(UnitType.UT_Length).DisplayUnits instead.")> _
Public Function GetDisplayUnitType As DisplayUnitType
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015.  Use GetFormatOptions(UnitType.UT_Length).DisplayUnits instead.")]
public:
DisplayUnitType GetDisplayUnitType()
Return Value
 The length display unit.
Remarks
 This method is equivalent to GetFormatOptions(UnitType.UT_Length).DisplayUnits.
See Also
Units Class
Autodesk.Revit.DB Namespace